<?php
//==============================================================================
// FusionDatabase
//------------------------------------------------------------------------------
// データベース定義保持クラス
// 
// 
// 
// 
//==============================================================================
class FusionDatabase
{
	private $_name;											// リソース名
	private $_driver;										// 接続ドライバー名
	private $_master;										// DBサーバー情報[メイン]
	private $_slaves;										// DBサーバー情報[サブ](複数可)

	//--------------------------------------------------------------------------
	// FusionDatabase::__construct
	//--------------------------------------------------------------------------
	// FusionDatabaseコンストラクタ
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function __construct($name, $driver)
	{
		$this->_name			= $name;					// DB管理名
		$this->_driver			= $driver;					// 接続ドライバー名
		$this->_master			= null;						// DBサーバー情報[メイン]
		$this->_slaves			= array();					// DBサーバー情報[サブ](複数可)
	}

	//--------------------------------------------------------------------------
	// FusionDatabase::getName
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function getName()
	{
		return ($this->_name);
	}

	//--------------------------------------------------------------------------
	// FusionDatabase::getDriver
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function getDriver()
	{
		return ($this->_driver);
	}

	//--------------------------------------------------------------------------
	// FusionDatabase::getMaster
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function getMaster()
	{
		return ($this->_master);
	}

	//--------------------------------------------------------------------------
	// FusionDatabase::getSlaves
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function getSlaves()
	{
		return ($this->_slaves);
	}

	//--------------------------------------------------------------------------
	// FusionDatabase::setMasterDatabase
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function setMasterDatabase($host, $port, $schema, $user, $pass, $parentBasedir)
	{
		$this->_master			= new FusionDatabaseInfo("SLAVE", $host, $port, $schema, $user, $pass, $this->_driver, $parentBasedir);		// インスタンス生成
	}

	//--------------------------------------------------------------------------
	// FusionDatabase::addSlaveDatabase
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function addSlaveDatabase($host, $port, $schema, $user, $pass, $parentBasedir)
	{
		$addSlaveDatabaseInfo	= new FusionDatabaseInfo("SLAVE", $host, $port, $schema, $user, $pass, $this->_driver, $parentBasedir);		// インスタンス生成
		$this->_slaves[]		= $addSlaveDatabaseInfo;																	// サブリストに追加する
	}
}

//==============================================================================
// FusionDatabaseInfo
//------------------------------------------------------------------------------
// データベース情報保持クラス
// 
// 
// 
// 
//==============================================================================
class FusionDatabaseInfo
{
	private $_isError;									// エラーが発生したか否か
	private $_errorMessage;								// エラーが発生した時のメッセージ
	private $_type;										// DBタイプ[MASTER or SLAVE]
	private $_host;										// DBホスト名
	private $_port;										// DBポート番号
	private $_schema;									// DBスキーマ名
	private $_user;										// DBユーザー
	private $_pass;										// DBパスワード
	private $_connection;								// DBコネクション
	private $_driverInstance;							// DBドライバーインスタンス

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::__construct
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function __construct($type, $host, $port, $schema, $user, $pass, $driver, $parentBasedir)
	{
		$this->_type			= $type;				// DBタイプ[MASTER or SLAVE]
		$this->_host			= $host;				// DBホスト名
		$this->_port			= $port;				// DBポート番号
		$this->_schema			= $schema;				// DBスキーマ名
		$this->_user			= $user;				// DBユーザー
		$this->_pass			= $pass;				// DBパスワード
		$this->_connection		= null;					// DBコネクション
		$this->_driverInstance	= null;

		$this->_isError			= false;				// 現時点ではエラーは発生していない

		// ドライバー定義ファイルの存在チェック
		if (file_exists($parentBasedir."/FUSION3/database/".$driver.".php"))
		{
			require_once $parentBasedir."/FUSION3/database/".$driver.".php";
			if (class_exists($driver))
			{
				$this->_driverInstance		= new $driver($this);
			}
			else
			{
				// ドライバークラスが存在しない場合
				$this->_isError				= true;
				$this->_errorMessage		= "Database Driver Class is not fount[".$driver."]";
			}
		}
		else
		{
			// ドライバーファイルが存在しない場合
			$this->_isError				= true;
			$this->_errorMessage		= "Database Driver File is not fount[".$parentBasedir."/FUSION3/db/".$driver.".php"."]";
		}
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::checkError
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	private function checkError()
	{
		if ($this->_isError == true)
		{
			throw new Exception($this->_errorMessage);
		}
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::connect
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function connect()
	{
		// エラーチェック
		$this->checkError();

		// 取得した接続定義が接続済みか否かをチェックする
		if ($this->_connection == null)
		{
			// 未接続の場合はドライバーインスタンスを使って接続を行う
			$this->_connection	= $this->_driverInstance->connect();
		}
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::getConnection
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function getConnection()
	{
		return $this->_connection;
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::setNullConnection
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function setNullConnection()
	{
		$this->_connection = null;
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::getType
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function getType()
	{
		// エラーチェック
		$this->checkError();

		return ($this->_type);
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::getHost
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function getHost()
	{
		// エラーチェック
		$this->checkError();

		return ($this->_host);
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::getPort
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function getPort()
	{
		// エラーチェック
		$this->checkError();

		return ($this->_port);
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::getSchema
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function getSchema()
	{
		// エラーチェック
		$this->checkError();

		return ($this->_schema);
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::getUser
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function getUser()
	{
		// エラーチェック
		$this->checkError();

		return ($this->_user);
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::getPass
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function getPass()
	{
		// エラーチェック
		$this->checkError();

		return ($this->_pass);
	}


	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::setPreparedHash
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function setPreparedHash($preparedHash)
	{
		$this->_driverInstance->setPreparedHash($preparedHash);
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::querySEL
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function querySEL($sql)
	{
		// エラーチェック
		$this->checkError();

		$this->connect();
		return $this->_driverInstance->querySEL($this->_driverInstance->sqlForBind($sql));
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::queryIUD
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function queryIUD($sql)
	{
		// エラーチェック
		$this->checkError();

		$this->connect();
		return $this->_driverInstance->queryIUD($this->_driverInstance->sqlForBind($sql));
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::fetch
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function fetch()
	{
		// エラーチェック
		$this->checkError();

		$this->connect();
		return $this->_driverInstance->fetch();
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::begin
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function begin()
	{
		// エラーチェック
		$this->checkError();

		$this->connect();
		return $this->_driverInstance->begin();
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::commit
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function commit()
	{
		// エラーチェック
		$this->checkError();

		$this->connect();
		return $this->_driverInstance->commit();
	}

	//--------------------------------------------------------------------------
	// FusionDatabaseInfo::rollback
	//--------------------------------------------------------------------------
	// 
	// 
	// 
	// 
	// 
	//--------------------------------------------------------------------------
	public function rollback()
	{
		// エラーチェック
		$this->checkError();

		$this->connect();
		return $this->_driverInstance->rollback();
	}
}
?>
